#include "Draw_Line.h"

// 每行宽度表，下标对应Y
int Ring_Width_Table[120] =
{
14,14,14,16,16,18,18,20,20,
20,20,22,22,26,26,26,26,30,30,30,30,
34,34,36,36,38,38,40,40,44,44,44,44,
48,48,50,50,50,50,54,54,54,54,58,58,
58,58,62,62,62,64,66,66,68,68,70,70,
72,72,74,74,76,76,78,78,82,82,82,82,
86,86,88,88,90,90,92,92,94,94,96,96,
98,98,100,100,104,104,104,104,108,108,108,108,
112,112,112,112,116,116,116,116,120,120,122,122,
124,124,126,126,128,128,132,132,132,132,136,136,
136,136,136
};

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     输入两点坐标补左边线
// 参数说明
// 返回参数
// 使用示例
// 备注信息
//------------------------------------------------------------------------------------------------------------------
void Patch_line_Left(int16 zuobiao_botton[2], int16 zuobiao_top[2])
{
    /* 斜率  常数项 */
    float K = 0.0f, b = 0.0f;
	int16 j;
    //k = (y2 - y1) / (x2 - x1);
    K = (float)((float)zuobiao_top[1] - (float)zuobiao_botton[1]) / (float)((float)zuobiao_top[0] - (float)zuobiao_botton[0]);

    b = (float)((float)zuobiao_top[1] - K * (float)zuobiao_top[0]);

    for(j = zuobiao_top[1]; j < zuobiao_botton[1]; j ++)  //上到下 j是行
    {
        //x = (y - b) / k
        Left_Line[j] = (float)((float)j - (float)b) / (float)K; //Left_Line[j]是得到的列坐标
        Image_Use[j][Left_Line[j]] = 0;
    }
}

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     输入两点坐标补右边线
// 参数说明
// 返回参数
// 使用示例
// 备注信息
//------------------------------------------------------------------------------------------------------------------
void Patch_line_Right(int16 zuobiao_botton[2], int16 zuobiao_top[2])
{
    /* 斜率  常数项 */
    float K = 0.0f, b = 0.0f;
	int16 j;

    K = (float)((float)zuobiao_top[1] - (float)zuobiao_botton[1]) / (float)((float)zuobiao_top[0] - (float)zuobiao_botton[0]);

    b = (float)((float)zuobiao_top[1] - K * (float)zuobiao_top[0]);

    for(j = zuobiao_top[1]; j < zuobiao_botton[1]; j ++)
    {
        Right_Line[j] = (float)((float)j - (float)b) / (float)K;
        Image_Use[j][Right_Line[j]] = 0;
    }
}


//-------------------------------------------------------------------------------------------------------------------
// 函数简介     根据右边界得到左边界
// 参数说明
// 返回参数
// 使用示例
// 备注信息
//------------------------------------------------------------------------------------------------------------------
void Add_mid_left(int start, int end)
{
    int t;
	int H;
    //自动调整位置
    if (start < end)
    {
        t = start;
        start = end;
        end = t;
    }
    for (H = start; H >= end; H--)
    {
        //左边界等于右边界加上赛道宽度
        Left_Line[H] = Right_Line[H] - 60;
        if(Left_Line[H] > 40) Left_Line[H] = 0;
        Image_Use[H][Left_Line[H]] = 0;
    }
}

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     根据左边界得到右边界
// 参数说明
// 返回参数
// 使用示例
// 备注信息
//------------------------------------------------------------------------------------------------------------------
void Patch_line_Right_Init(int start, int end)
{
	int t;
	int y;
	//自动调整位置
    if (start < end)
    {
        t = start;
        start = end;
        end = t;
    }
    for(y = start; y < end; y++)
    {
        if(y >= 120) continue;
        if(Left_Line[y] < 20 && Right_Line[y] < MT9V03X_W-20)
		{
			Right_Line[y] = Left_Line[y] + Ring_Width_Table[y];
		}
        // 左线保持不变
        // 右线 = 左线 + 当前行标准宽度
//        Right_Line[y] = Left_Line[y] + Ring_Width_Table[y];
    }
}

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     根据右边界得到左边界
// 参数说明
// 返回参数
// 使用示例
// 备注信息
//------------------------------------------------------------------------------------------------------------------
void Patch_line_Left_Init(int start, int end)
{
	int t;
	int y;
	//自动调整位置
    if (start < end)
    {
        t = start;
        start = end;
        end = t;
    }
    for(y = start; y < end; y++)
    {
        if(y >= 120) continue;
        if(Right_Line[y] > MT9V03X_W-20 && Right_Line[y] > 20)
		{
			Left_Line[y] = Right_Line[y] - Ring_Width_Table[y];
		}
        // 右线保持不变
        // 左线 = 右线 - 当前行标准宽度
//        Left_Line[y] = Right_Line[y] - Ring_Width_Table[y];
    }
}

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     根据左边界得到右边界
// 参数说明
// 返回参数
// 使用示例
// 备注信息
//------------------------------------------------------------------------------------------------------------------
void Right_Patch_Init(void)
{
	int y;
    for(y = 0; y < MT9V03X_H; y++)
    {
        if(y >= 120) continue;
        
        // 左线保持不变
        // 右线 = 左线 + 当前行标准宽度
        Right_Line[y] = Left_Line[y] + Ring_Width_Table[y];
    }
}

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     根据右边界得到左边界
// 参数说明
// 返回参数
// 使用示例
// 备注信息
//------------------------------------------------------------------------------------------------------------------
void Left_Patch_Init(void)
{
	int y;
    for(y = 0; y < MT9V03X_H; y++)
    {
        if(y >= 120) continue;
        
        // 右线保持不变
        // 左线 = 右线 - 当前行标准宽度
        Left_Line[y] = Right_Line[y] - Ring_Width_Table[y];
    }
}
