#include "Protect.h"

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     丢线保护
// 参数说明
// 返回参数
// 使用示例
// 备注信息     用于丢线保护
//------------------------------------------------------------------------------------------------------------------
void Lost_Line_Protect(void)
{
    /* 直接把停车标志位置2，到状态机最后状态 */
    if(lost_line_protect == 1)
    {
        /* 保护(停车)标志置2 */
        Stop_Car_flag = 2;

        /* 无刷标志位置0 */
        Blds_flag = 0;
    }
}
